NessieCircuits/Riotee_SDK/arduino/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
# Copyright (c) 2016 Sandeep Mistry All right reserved.
# Copyright (c) 2023 Nessie Circuits. All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# CAUTION: Arduino cashes the board definitions in ~/.config/arduino-ide (Linux).
# You must delete this directory in order for changes in boards.txt to be applied.

menu.stacksize=StackSize
menu.retainedsize=Retained Memory Size

RioteeBoard.name=Riotee Board

RioteeBoard.upload.tool=openocd
RioteeBoard.upload.protocol=cmsis-dap
RioteeBoard.upload.target=nrf52
RioteeBoard.upload.maximum_size=524288
RioteeBoard.upload.setup_command=transport select swd;
RioteeBoard.upload.use_1200bps_touch=false
RioteeBoard.upload.wait_for_upload_port=false
RioteeBoard.upload.native_usb=false

RioteeBoard.bootloader.tool=openocd

RioteeBoard.build.mcu=cortex-m4
RioteeBoard.build.f_cpu=64000000
RioteeBoard.build.board=GENERIC
RioteeBoard.build.core=Riotee
RioteeBoard.build.variant=RioteeBoard
RioteeBoard.build.variant_system_lib=
RioteeBoard.build.extra_flags=-DNRF52833_XXAA
RioteeBoard.build.float_flags=-mabi=aapcs -mfloat-abi=hard -mfpu=fpv4-sp-d16
RioteeBoard.build.ldscript={build.core.path}/external/linker.ld
RioteeBoard.build.openocdscript=openocd_scripts/riotee_board.cfg
RioteeBoard.build.stacksize=1024
RioteeBoard.build.retainedsize=8192

RioteeBoard.menu.stacksize.512=512B
RioteeBoard.menu.stacksize.512.build.stacksize=512
RioteeBoard.menu.stacksize.1024=1kB
RioteeBoard.menu.stacksize.1024.build.stacksize=1024
RioteeBoard.menu.stacksize.2048=2kB
RioteeBoard.menu.stacksize.2048.build.stacksize=2048
RioteeBoard.menu.stacksize.2048=4kB
RioteeBoard.menu.stacksize.2048.build.stacksize=4096

RioteeBoard.menu.retainedsize.8192=8kB
RioteeBoard.menu.retainedsize.8192.build.retainedsize=8192
RioteeBoard.menu.retainedsize.16384=16kB
RioteeBoard.menu.retainedsize.16384.build.retainedsize=16384
RioteeBoard.menu.retainedsize.32768=32kB
RioteeBoard.menu.retainedsize.32768.build.retainedsize=32768
RioteeBoard.menu.retainedsize.65536=64kB
RioteeBoard.menu.retainedsize.65536.build.retainedsize=65536
